#+title:  Appendix 2 - Group Theory
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:python :session *appendix-2* :tangle appendix_2.py

#+toc: headlines 2

*** Solution
It is convenient to work with =sympy=. First let us define the group $S_3$ and its
representation $\rho_{\mathrm{perm}}$ as permutation matrices.

#+begin_src python
  group_s3 = [[0, 1, 2], [1, 2, 0], [2, 0, 1], [1, 0, 2], [0, 2, 1], [2, 1, 0]]
  group_s3 = [Permutation(g) for g in group_s3]

  s3_perm = [PermutationMatrix(g).as_explicit() for g in group_s3]
#+end_src

# essentially created by code block create-latex-exercise-a2-16:
$$
\left[\begin{matrix}1 & 0 & 0\\0 & 1 & 0\\0 & 0 & 1\end{matrix}\right], \;
\left[\begin{matrix}0 & 1 & 0\\0 & 0 & 1\\1 & 0 & 0\end{matrix}\right], \;
\left[\begin{matrix}0 & 0 & 1\\1 & 0 & 0\\0 & 1 & 0\end{matrix}\right], \;
\left[\begin{matrix}0 & 1 & 0\\1 & 0 & 0\\0 & 0 & 1\end{matrix}\right], \;
\left[\begin{matrix}1 & 0 & 0\\0 & 0 & 1\\0 & 1 & 0\end{matrix}\right], \;
\left[\begin{matrix}0 & 0 & 1\\0 & 1 & 0\\1 & 0 & 0\end{matrix}\right]
$$

Observe that $\rho_{\mathrm{perm}}$ is faithful. It is not irreducible: First of all, the
character is given by:

#+begin_src python :results replace verbatim :tangle no :cache yes
  [trace(g) for g in s3_perm]
#+end_src

#+RESULTS[092364b78868df74e52d14deefac60d66187e662]:
: [3, 0, 0, 1, 1, 1]

The norm of this (see [[#class-functions-hilbert-space][Class Functions as a Hilbert Space]]) is bigger than $1$ hence it is
not irreducible [[irreducible-chars-norm-one][since]] a character is irreducible iff its norm is $1$. We can also see this
directly by observing that $V_{\mathrm{triv}}=\CC(1,1,1)$ is an invariant subspace.

The trivial representation exists for every group:

$$
  \rho_{\mathrm{triv}}(g) = 1 \in \CC .
$$

The non-trivial one-dimensional representation can be defined via:

$$
  \rho_{\mathrm{sign}}(g) = \det(\rho_{\mathrm{perm}}(g)) \in \{-1, +1\} \subseteq \CC .
$$

It acts as desired:

#+begin_src python :results replace verbatim :tangle no :cache yes
  [det(g) for g in s3_perm]
#+end_src

#+RESULTS[10b418368758c4c260183e598a6c268d33949037]:
: [1, 1, 1, -1, -1, -1]

Let us briefly mention that this is related to the [[https://en.wikipedia.org/wiki/Parity_of_a_permutation][parity of permutations]], and can
alternatively calculated by counting the number of binary swaps $(x \; y)$ in the cycle
representation (odd count means $-1$, even count means $+1$).

Let $V_{\mathrm{std}}=V_{\mathrm{triv}}^\perp$. By definition

$$ \CC^3=V_{\mathrm{triv}}\oplus V_{\mathrm{std}} . $$

We claim that $\rho_{\mathrm{perm}}$ restricted to $V_{\mathrm{std}}$ is the 2D
representation $\rho_{\mathrm{std}}$ presented in the exercise statement (for a certain
choice of basis in $V_{\mathrm{std}}$). But first let us observe that this restriction is
indeed irreducible. In fact (c.f. [[decomposition-of-characters][decomposition of characters]]):

$$
  \chi_{\mathrm{std}} = \chi_{\mathrm{perm}} - \chi_{\mathrm{triv}}
  = (2, -1, -1, 0, 0, 0) .
$$

The norm of this is $1$. Hence we know that it must be irreducible although we haven't
calculated the representation yet! Let us show that

#+begin_src python
  s3_std = [
      Matrix([[1, 0], [0, 1]]),
      Matrix([[-1, -sqrt(3)], [sqrt(3), -1]]) / 2,
      Matrix([[-1, sqrt(3)], [-sqrt(3), -1]]) / 2,
      Matrix([[-1, 0], [0, 1]]),
      Matrix([[1, -sqrt(3)], [-sqrt(3), -1]]) / 2,
      Matrix([[1, sqrt(3)], [sqrt(3), -1]]) / 2,
  ]
#+end_src

is indeed the second summand in
$\rho_{\mathrm{perm}}=\rho_{\mathrm{triv}}\oplus\rho_{\mathrm{std}}$. The following
unitary matrix is the G-isomorphism which shows this:

#+begin_src python
  U_std = Matrix([
      [sqrt(3)/3, -sqrt(2)/2,  sqrt(6)/6],
      [sqrt(3)/3,  sqrt(2)/2,  sqrt(6)/6],
      [sqrt(3)/3,          0, -sqrt(6)/3]
  ])
#+end_src

How did we find it? It is clear that we have to choose a spanning vector of the invariant
subspace $\CC(1,1,1)$ as the first column to obtain the trivial representation as the
first summand. How to choose the other two columns is only important to obtain the
/particular/ matrices given in the exercise. The second column is easily seen to be a
multiple of $(1,1,0)$ when looking at the fourth matrix. The last column is essentially
fixed by the unitarity constraint.

A brief check that it does what we want:

#+begin_src python :results replace :tangle no :cache yes
  assert U_std.H * U_std == eye(3)

  for i in range(6):
      print(i)
      G = U_std.H * s3_perm[i] * U_std
      G.col_del(0)
      G.row_del(0)

      assert G == s3_std[i]

  "PASSED"
#+end_src

#+RESULTS[e2133cde752b67eebdbc07889c379946bc2ba490]:
: PASSED

Orthogonality of the three irreducible representation already follows from the fact that
they are irreducible, but can be easily check directly of course. QED.

Another way to see that the 2D matrices form a (faithful) representation is the
following. First observe that the second and the fourth element generate the group:

#+begin_src python :results replace :tangle no :cache yes
  a = group_s3[1]
  b = group_s3[3]

  assert a**3 == b**2 == group_s3[0]
  assert a**(-1) == group_s3[2]
  assert a**(-1) * b * a == group_s3[4]
  assert a * b * a**(-1) == group_s3[5]

  "PASSED"
#+end_src

#+RESULTS[9269d11b1de9da0095ab49ede772d9d3a371c225]:
: PASSED

From an algebraic perspective this describes the group completely. Hence we just have to
show that the analogous formulas hold for $\rho_{\mathrm{std}}$ too:

#+begin_src python :results replace :tangle no :cache yes
  A = s3_std[1]
  B = s3_std[3]

  assert A**3 == B**2 == s3_std[0]
  assert A**(-1) == s3_std[2]
  assert A**(-1) * B * A == s3_std[4]
  assert A * B * A**(-1) == s3_std[5]

  "PASSED"
#+end_src

#+RESULTS[4b0f05ad7796fdd8b221441fcf96a2f6f8a084b5]:
: PASSED

# Some auxiliary code:

#+name: create-latex-exercise-a2-16
#+begin_src python :tangle no :exports none :eval no
  # Use this code to create the latex formulas for the matrices of the standard representations for
  # the exercise statement
  print(", \\; \n".join([sp.latex(s) for s in s3_std]))
#+end_src

